package kanjinum

import (
	"math/big"
	"testing"
)

func TestKanjiNumber(t *testing.T) {
	testcases := []string{
		"-1", "0", "1",
		"6", "10", "11", "20", "100", "1000", "1234",
		"100000000", "100000005",
		"99999999999999999999999999999999999999999999999999999999999999999999",
		"100000000000000000000000000000000000000000000000000000000000000000000",
		"100000000000000000000000000000000000000000000000000000000000000000001",
	}
	expected := []string{
		"負ノ一", "零", "正ノ一",
		"正ノ六", "正ノ十", "正ノ十一", "正ノ二十", "正ノ百", "正ノ千", "正ノ千二百三十四",
		"正ノ一億", "正ノ一億五",
		"正ノ九千九百九十九不可思議九千九百九十九那由他九千九百九十九阿僧祇九千九百九十九恒河沙九千九百九十九極九千九百九十九載九千九百九十九正九千九百九十九澗九千九百九十九溝九千九百九十九穣九千九百九十九𥝱九千九百九十九垓九千九百九十九京九千九百九十九兆九千九百九十九億九千九百九十九万九千九百九十九",
		"正ノ無量大数",
		"正ノ無量大数",
	}
	for i, s := range testcases {
		n, _ := new(big.Int).SetString(s, 10)
		actual := NumToKanji(n)
		if actual != expected[i] {
			t.Errorf("KanjiNumber() is invalid: got %v, wanted %v", actual, expected[i])
		}
	}
}
