package kanjinum

import (
	"math/big"
	"testing"
)

func TestKanjiNumber(t *testing.T) {
	testcases := []string{
		"-1",
		"0",
		"1",
		"10",
		"-11",
		"20",
		"1234",
		"12345",
		"123456",
		"-1234567",
		"12345678",
		"99999999999999999999999999999999999999999999999999999999999999999999",
		"100000000000000000000000000000000000000000000000000000000000000000000",
		"100000000000000000000000000000000000000000000000000000000000000000001",
	}
	expected := []string{
		"負ノ一",
		"零",
		"正ノ一",
		"正ノ十",
		"負ノ十一",
		"正ノ二十",
		"正ノ千二百三十四",
		"正ノ一万二千三百四十五",
		"正ノ十二万三千四百五十六",
		"負ノ百二十三万四千五百六十七",
		"正ノ千二百三十四万五千六百七十八",
		"正ノ九千九百九十九不可思議九千九百九十九那由他九千九百九十九阿僧祇九千九百九十九恒河沙九千九百九十九極九千九百九十九載九千九百九十九正九千九百九十九澗九千九百九十九溝九千九百九十九穣九千九百九十九𥝱九千九百九十九垓九千九百九十九京九千九百九十九兆九千九百九十九億九千九百九十九万九千九百九十九",
		"正ノ無量大数",
		"正ノ無量大数",
	}
	for i, s := range testcases {
		n, _ := new(big.Int).SetString(s, 10)
		actual := NumToKanji(n)
		if actual != expected[i] {
			t.Errorf("KanjiNumber() is invalid: got %v, wanted %v", actual, expected[i])
		}
	}
}
